konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/riscv_dm.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : RISCV_DM
# Version        : 1
# Bus type       : apb
# Description    : RISC-V Debug module registers (Hazard3 subset only). Read-
#                  only information fields (such as dmstatus.version) are
#                  listed here with the values they have on the RP2350
#                  instantiation of Hazard3.
# =============================================================================
.ifndef	_HARDWARE_REGS_RISCV_DM_H
.set	_HARDWARE_REGS_RISCV_DM_H, 1
# =============================================================================
# Register    : RISCV_DM_DATA0
# Description : data0 through data11 are basic read/write registers that may be
#               read or changed by abstract commands. abstractcs.datacount
#               indicates how many of them are implemented, starting at data0,
#               counting up.
#
#               Accessing these registers while an abstract command is
#               executing causes abstractcs.cmderr to be set to 1 (busy) if it
#               is 0.
#
#               Attempts to write them while abstractcs.busy is set does not
#               change their value.
#
#               The values in these registers may not be preserved after an
#               abstract command is executed. The only guarantees on their
#               contents are the ones offered by the command in question. If
#               the command fails, no assumptions can be made about the
#               contents of these registers.
#
#               (Note: Hazard3 implements data0 only.)
.equ	RISCV_DM_DATA0_OFFSET, 0x00000010
.equ	RISCV_DM_DATA0_BITS, 0xffffffff
.equ	RISCV_DM_DATA0_RESET, 0x00000000
.equ	RISCV_DM_DATA0_MSB, 31
.equ	RISCV_DM_DATA0_LSB, 0
# =============================================================================
# Register    : RISCV_DM_DMCONTROL
# Description : This register controls the overall Debug Module as well as the
#               currently selected harts, as defined in hasel.
.equ	RISCV_DM_DMCONTROL_OFFSET, 0x00000040
.equ	RISCV_DM_DMCONTROL_BITS, 0xf7ffffcf
.equ	RISCV_DM_DMCONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_HALTREQ
# Description : Writing 0 clears the halt request bit for all currently
#               selected harts. This may cancel outstanding halt requests for
#               those harts.
#
#               Writing 1 sets the halt request bit for all currently selected
#               harts. Running harts will halt whenever their halt request bit
#               is set.
#
#               Writes apply to the new value of hartsel and hasel.
.equ	RISCV_DM_DMCONTROL_HALTREQ_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_HALTREQ_BITS, 0x80000000
.equ	RISCV_DM_DMCONTROL_HALTREQ_MSB, 31
.equ	RISCV_DM_DMCONTROL_HALTREQ_LSB, 31
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_RESUMEREQ
# Description : Writing 1 causes the currently selected harts to resume once,
#               if they are halted when the write occurs. It also clears the
#               resume ack bit for those harts.
#
#               resumereq is ignored if haltreq is set.
#
#               Writes apply to the new value of hartsel and hasel.
.equ	RISCV_DM_DMCONTROL_RESUMEREQ_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_RESUMEREQ_BITS, 0x40000000
.equ	RISCV_DM_DMCONTROL_RESUMEREQ_MSB, 30
.equ	RISCV_DM_DMCONTROL_RESUMEREQ_LSB, 30
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_HARTRESET
# Description : This optional field writes the reset bit for all the currently
#               selected harts. To perform a reset the debugger writes 1, and
#               then writes 0 to deassert the reset signal.
#
#               While this bit is 1, the debugger must not change which harts
#               are selected.
#
#               Writes apply to the new value of hartsel and hasel.
#
#               (The exact behaviour of this field is implementation-defined:
#               on RP2350 it (triggers a local reset of the selected core(s)
#               only.)
.equ	RISCV_DM_DMCONTROL_HARTRESET_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_HARTRESET_BITS, 0x20000000
.equ	RISCV_DM_DMCONTROL_HARTRESET_MSB, 29
.equ	RISCV_DM_DMCONTROL_HARTRESET_LSB, 29
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_ACKHAVERESET
# Description : 0: No effect.
#
#               1: Clears havereset for any selected harts.
#
#               Writes apply to the new value of hartsel and hasel.
.equ	RISCV_DM_DMCONTROL_ACKHAVERESET_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_ACKHAVERESET_BITS, 0x10000000
.equ	RISCV_DM_DMCONTROL_ACKHAVERESET_MSB, 28
.equ	RISCV_DM_DMCONTROL_ACKHAVERESET_LSB, 28
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_HASEL
# Description : Selects the definition of currently selected harts.
#
#               0: There is a single currently selected hart, that is selected
#               by hartsel.
#
#               1: There may be multiple currently selected harts – the hart
#               selected by hartsel, plus those selected by the hart array mask
#               register.
#
#               Hazard3 does support the hart array mask.
.equ	RISCV_DM_DMCONTROL_HASEL_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_HASEL_BITS, 0x04000000
.equ	RISCV_DM_DMCONTROL_HASEL_MSB, 26
.equ	RISCV_DM_DMCONTROL_HASEL_LSB, 26
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_HARTSELLO
# Description : The low 10 bits of hartsel: the DM-specific index of the hart
#               to select. This hart is always part of the currently selected
#               harts.
#
#               On RP2350, since there are only two cores (with one hart each),
#               only the least-significant bit is writable. The others are tied
#               to 0.
.equ	RISCV_DM_DMCONTROL_HARTSELLO_RESET, 0x000
.equ	RISCV_DM_DMCONTROL_HARTSELLO_BITS, 0x03ff0000
.equ	RISCV_DM_DMCONTROL_HARTSELLO_MSB, 25
.equ	RISCV_DM_DMCONTROL_HARTSELLO_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_HARTSELHI
# Description : The high 10 bits of hartsel: the DM-specific index of the hart
#               to select. This hart is always part of the currently selected
#               harts.
#
#               On Hazard3 this field is always tied to all-zeroes.
.equ	RISCV_DM_DMCONTROL_HARTSELHI_RESET, 0x000
.equ	RISCV_DM_DMCONTROL_HARTSELHI_BITS, 0x0000ffc0
.equ	RISCV_DM_DMCONTROL_HARTSELHI_MSB, 15
.equ	RISCV_DM_DMCONTROL_HARTSELHI_LSB, 6
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_SETRESETHALTREQ
# Description : This optional field writes the halt-on-reset request bit for
#               all currently selected harts, unless clrresethaltreq is
#               simultaneously set to 1.
#
#               When set to 1, each selected hart will halt upon the next
#               deassertion of its reset. The halt-on-reset request bit is not
#               automatically cleared. The debugger must write to
#               clrresethaltreq to clear it.
#
#               Writes apply to the new value of hartsel and hasel.
.equ	RISCV_DM_DMCONTROL_SETRESETHALTREQ_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_SETRESETHALTREQ_BITS, 0x00000008
.equ	RISCV_DM_DMCONTROL_SETRESETHALTREQ_MSB, 3
.equ	RISCV_DM_DMCONTROL_SETRESETHALTREQ_LSB, 3
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_CLRRESETHALTREQ
# Description : This optional field clears the halt-on-reset request bit for
#               all currently selected harts.
#
#               Writes apply to the new value of hartsel and hasel.
.equ	RISCV_DM_DMCONTROL_CLRRESETHALTREQ_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_CLRRESETHALTREQ_BITS, 0x00000004
.equ	RISCV_DM_DMCONTROL_CLRRESETHALTREQ_MSB, 2
.equ	RISCV_DM_DMCONTROL_CLRRESETHALTREQ_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_NDMRESET
# Description : This bit controls the reset signal from the DM to the rest of
#               the system. The signal should reset every part of the system,
#               including every hart, except for the DM and any logic required
#               to access the DM. To perform a system reset the debugger writes
#               1, and then writes 0 to deassert the reset.
#
#               On RP2350 this performs a cold reset, the equivalent of a
#               watchdog reset with all WDSEL bits set. This includes both
#               cores and all peripherals.
.equ	RISCV_DM_DMCONTROL_NDMRESET_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_NDMRESET_BITS, 0x00000002
.equ	RISCV_DM_DMCONTROL_NDMRESET_MSB, 1
.equ	RISCV_DM_DMCONTROL_NDMRESET_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMCONTROL_DMACTIVE
# Description : This bit serves as a reset signal for the Debug Module itself.
#
#               0: The module’s state, including authentication mechanism,
#               takes its reset values (the dmactive bit is the only bit which
#               can be written to something other than its reset value).
#
#               1: The module functions normally.
#
#               No other mechanism should exist that may result in resetting
#               the Debug Module after power up, with the possible (but not
#               recommended) exception of a global reset signal that resets the
#               entire platform.
#
#               (On RP2350, the Debug Module is reset by a power-on reset, a
#               brownout reset, the RUN pin, and a rescue reset.)
#
#               A debugger may pulse this bit low to get the Debug Module into
#               a known state.
.equ	RISCV_DM_DMCONTROL_DMACTIVE_RESET, 0x0
.equ	RISCV_DM_DMCONTROL_DMACTIVE_BITS, 0x00000001
.equ	RISCV_DM_DMCONTROL_DMACTIVE_MSB, 0
.equ	RISCV_DM_DMCONTROL_DMACTIVE_LSB, 0
# =============================================================================
# Register    : RISCV_DM_DMSTATUS
# Description : This register reports status for the overall Debug Module as
#               well as the currently selected harts, as defined in hasel. Its
#               address will not change in the future, because it contains
#               version.
#
#               This entire register is read-only.
.equ	RISCV_DM_DMSTATUS_OFFSET, 0x00000044
.equ	RISCV_DM_DMSTATUS_BITS, 0x004fffff
.equ	RISCV_DM_DMSTATUS_RESET, 0x004000a2
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_IMPEBREAK
# Description : If 1, then there is an implicit ebreak instruction at the non-
#               existent word immediately after the Program Buffer. This saves
#               the debugger from having to write the ebreak itself, and allows
#               the Program Buffer to be one word smaller.
.equ	RISCV_DM_DMSTATUS_IMPEBREAK_RESET, 0x1
.equ	RISCV_DM_DMSTATUS_IMPEBREAK_BITS, 0x00400000
.equ	RISCV_DM_DMSTATUS_IMPEBREAK_MSB, 22
.equ	RISCV_DM_DMSTATUS_IMPEBREAK_LSB, 22
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ALLHAVERESET
# Description : This field is 1 when all currently selected harts have been
#               reset and reset has not been acknowledged for any of them.
.equ	RISCV_DM_DMSTATUS_ALLHAVERESET_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_ALLHAVERESET_BITS, 0x00080000
.equ	RISCV_DM_DMSTATUS_ALLHAVERESET_MSB, 19
.equ	RISCV_DM_DMSTATUS_ALLHAVERESET_LSB, 19
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ANYHAVERESET
# Description : This field is 1 when at least one currently selected hart has
#               been reset and reset has not been acknowledged for that hart.
.equ	RISCV_DM_DMSTATUS_ANYHAVERESET_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_ANYHAVERESET_BITS, 0x00040000
.equ	RISCV_DM_DMSTATUS_ANYHAVERESET_MSB, 18
.equ	RISCV_DM_DMSTATUS_ANYHAVERESET_LSB, 18
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ALLRESUMEACK
# Description : This field is 1 when all currently selected harts have
#               acknowledged their last resume request.
.equ	RISCV_DM_DMSTATUS_ALLRESUMEACK_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_ALLRESUMEACK_BITS, 0x00020000
.equ	RISCV_DM_DMSTATUS_ALLRESUMEACK_MSB, 17
.equ	RISCV_DM_DMSTATUS_ALLRESUMEACK_LSB, 17
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ANYRESUMEACK
# Description : This field is 1 when any currently selected hart has
#               acknowledged its last resume request.
.equ	RISCV_DM_DMSTATUS_ANYRESUMEACK_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_ANYRESUMEACK_BITS, 0x00010000
.equ	RISCV_DM_DMSTATUS_ANYRESUMEACK_MSB, 16
.equ	RISCV_DM_DMSTATUS_ANYRESUMEACK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ALLNONEXISTENT
# Description : This field is 1 when all currently selected harts do not exist
#               on this platform.
.equ	RISCV_DM_DMSTATUS_ALLNONEXISTENT_BITS, 0x00008000
.equ	RISCV_DM_DMSTATUS_ALLNONEXISTENT_MSB, 15
.equ	RISCV_DM_DMSTATUS_ALLNONEXISTENT_LSB, 15
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ANYNONEXISTENT
# Description : This field is 1 when any currently selected hart does not exist
#               in this platform.
.equ	RISCV_DM_DMSTATUS_ANYNONEXISTENT_BITS, 0x00004000
.equ	RISCV_DM_DMSTATUS_ANYNONEXISTENT_MSB, 14
.equ	RISCV_DM_DMSTATUS_ANYNONEXISTENT_LSB, 14
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ALLUNAVAIL
# Description : This field is 1 when all currently selected harts are
#               unavailable.
.equ	RISCV_DM_DMSTATUS_ALLUNAVAIL_BITS, 0x00002000
.equ	RISCV_DM_DMSTATUS_ALLUNAVAIL_MSB, 13
.equ	RISCV_DM_DMSTATUS_ALLUNAVAIL_LSB, 13
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ANYUNAVAIL
# Description : This field is 1 when any currently selected hart is
#               unavailable.
.equ	RISCV_DM_DMSTATUS_ANYUNAVAIL_BITS, 0x00001000
.equ	RISCV_DM_DMSTATUS_ANYUNAVAIL_MSB, 12
.equ	RISCV_DM_DMSTATUS_ANYUNAVAIL_LSB, 12
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ALLRUNNING
# Description : This field is 1 when all currently selected harts are running.
.equ	RISCV_DM_DMSTATUS_ALLRUNNING_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_ALLRUNNING_BITS, 0x00000800
.equ	RISCV_DM_DMSTATUS_ALLRUNNING_MSB, 11
.equ	RISCV_DM_DMSTATUS_ALLRUNNING_LSB, 11
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ANYRUNNING
# Description : This field is 1 when any currently selected hart is running.
.equ	RISCV_DM_DMSTATUS_ANYRUNNING_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_ANYRUNNING_BITS, 0x00000400
.equ	RISCV_DM_DMSTATUS_ANYRUNNING_MSB, 10
.equ	RISCV_DM_DMSTATUS_ANYRUNNING_LSB, 10
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ALLHALTED
# Description : This field is 1 when all currently selected harts are halted.
.equ	RISCV_DM_DMSTATUS_ALLHALTED_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_ALLHALTED_BITS, 0x00000200
.equ	RISCV_DM_DMSTATUS_ALLHALTED_MSB, 9
.equ	RISCV_DM_DMSTATUS_ALLHALTED_LSB, 9
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_ANYHALTED
# Description : This field is 1 when any currently selected hart is halted.
.equ	RISCV_DM_DMSTATUS_ANYHALTED_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_ANYHALTED_BITS, 0x00000100
.equ	RISCV_DM_DMSTATUS_ANYHALTED_MSB, 8
.equ	RISCV_DM_DMSTATUS_ANYHALTED_LSB, 8
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_AUTHENTICATED
# Description : 0: Authentication is required before using the DM.
#
#               1: The authentication check has passed.
#
#               On components that don’t implement authentication, this bit
#               must be preset as 1. (Note: the version of Hazard3 on RP2350
#               does not implement authentication.)
.equ	RISCV_DM_DMSTATUS_AUTHENTICATED_RESET, 0x1
.equ	RISCV_DM_DMSTATUS_AUTHENTICATED_BITS, 0x00000080
.equ	RISCV_DM_DMSTATUS_AUTHENTICATED_MSB, 7
.equ	RISCV_DM_DMSTATUS_AUTHENTICATED_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_AUTHBUSY
# Description : 0: The authentication module is ready to process the next
#               read/write to authdata.
#
#               1: The authentication module is busy. Accessing authdata
#               results in unspecified behavior. authbusy only becomes set in
#               immediate response to an access to authdata.
.equ	RISCV_DM_DMSTATUS_AUTHBUSY_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_AUTHBUSY_BITS, 0x00000040
.equ	RISCV_DM_DMSTATUS_AUTHBUSY_MSB, 6
.equ	RISCV_DM_DMSTATUS_AUTHBUSY_LSB, 6
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_HASRESETHALTREQ
# Description : 1 if this Debug Module supports halt-on-reset functionality
#               controllable by the setresethaltreq and clrresethaltreq bits. 0
#               otherwise.
.equ	RISCV_DM_DMSTATUS_HASRESETHALTREQ_RESET, 0x1
.equ	RISCV_DM_DMSTATUS_HASRESETHALTREQ_BITS, 0x00000020
.equ	RISCV_DM_DMSTATUS_HASRESETHALTREQ_MSB, 5
.equ	RISCV_DM_DMSTATUS_HASRESETHALTREQ_LSB, 5
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_CONFSTPTRVALID
# Description : 0: confstrptr0–confstrptr3 hold information which is not
#               relevant to the configuration string.
#
#               1: confstrptr0–confstrptr3 hold the address of the
#               configuration string.
.equ	RISCV_DM_DMSTATUS_CONFSTPTRVALID_RESET, 0x0
.equ	RISCV_DM_DMSTATUS_CONFSTPTRVALID_BITS, 0x00000010
.equ	RISCV_DM_DMSTATUS_CONFSTPTRVALID_MSB, 4
.equ	RISCV_DM_DMSTATUS_CONFSTPTRVALID_LSB, 4
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_DMSTATUS_VERSION
# Description : 0: There is no Debug Module present. 1: There is a Debug Module
#               and it conforms to version 0.11 of the RISC-V debug
#               specification.
#
#               2: There is a Debug Module and it conforms to version 0.13 of
#               the RISC-V debug specification.
#
#               15: There is a Debug Module but it does not con- form to any
#               available version of the RISC-V debug spec.
.equ	RISCV_DM_DMSTATUS_VERSION_RESET, 0x2
.equ	RISCV_DM_DMSTATUS_VERSION_BITS, 0x0000000f
.equ	RISCV_DM_DMSTATUS_VERSION_MSB, 3
.equ	RISCV_DM_DMSTATUS_VERSION_LSB, 0
# =============================================================================
# Register    : RISCV_DM_HARTINFO
# Description : This register gives information about the hart currently
#               selected by hartsel.
#
#               This entire register is read-only.
.equ	RISCV_DM_HARTINFO_OFFSET, 0x00000048
.equ	RISCV_DM_HARTINFO_BITS, 0x00f1ffff
.equ	RISCV_DM_HARTINFO_RESET, 0x00001bff
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_HARTINFO_NSCRATCH
# Description : Number of dscratch registers available for the debugger to use
#               during program buffer execution, starting from dscratch0. The
#               debugger can make no assumptions about the contents of these
#               registers between commands.
.equ	RISCV_DM_HARTINFO_NSCRATCH_RESET, 0x0
.equ	RISCV_DM_HARTINFO_NSCRATCH_BITS, 0x00f00000
.equ	RISCV_DM_HARTINFO_NSCRATCH_MSB, 23
.equ	RISCV_DM_HARTINFO_NSCRATCH_LSB, 20
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_HARTINFO_DATAACCESS
# Description : 0: The data registers are shadowed in the hart by CSRs. Each
#               CSR is DXLEN bits in size, and corresponds to a single
#               argument.
#
#               1: The data registers are shadowed in the hart’s memory map.
#               Each register takes up 4 bytes in the memory map.
.equ	RISCV_DM_HARTINFO_DATAACCESS_RESET, 0x0
.equ	RISCV_DM_HARTINFO_DATAACCESS_BITS, 0x00010000
.equ	RISCV_DM_HARTINFO_DATAACCESS_MSB, 16
.equ	RISCV_DM_HARTINFO_DATAACCESS_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_HARTINFO_DATASIZE
# Description : If dataaccess is 0: Number of CSRs dedicated to shadowing the
#               data registers.
#
#               If dataaccess is 1: Number of 32-bit words in the memory map
#               dedicated to shadowing the data registers.
.equ	RISCV_DM_HARTINFO_DATASIZE_RESET, 0x1
.equ	RISCV_DM_HARTINFO_DATASIZE_BITS, 0x0000f000
.equ	RISCV_DM_HARTINFO_DATASIZE_MSB, 15
.equ	RISCV_DM_HARTINFO_DATASIZE_LSB, 12
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_HARTINFO_DATAADDR
# Description : If dataaccess is 0: The number of the first CSR dedicated to
#               shadowing the data registers.
#
#               If dataaccess is 1: Signed address of RAM where the data
#               registers are shadowed, to be used to access relative to zero
#
#               On Hazard3 this indicates the single data register mapped as
#               dmdata0. There is actually only a single shared register,
#               internal to the Debug Module, and mirrored in each core's CSR
#               space.
.equ	RISCV_DM_HARTINFO_DATAADDR_RESET, 0xbff
.equ	RISCV_DM_HARTINFO_DATAADDR_BITS, 0x00000fff
.equ	RISCV_DM_HARTINFO_DATAADDR_MSB, 11
.equ	RISCV_DM_HARTINFO_DATAADDR_LSB, 0
# =============================================================================
# Register    : RISCV_DM_HALTSUM1
# Description : Each bit in this read-only register indicates whether any of a
#               group of harts is halted or not. Unavailable/nonexistent harts
#               are not considered to be halted.
#
#               Each bit in haltsum1 is an OR reduction of 32 bits' worth of
#               haltsum0. On RP2350, only the LSB is implemented.
.equ	RISCV_DM_HALTSUM1_OFFSET, 0x0000004c
.equ	RISCV_DM_HALTSUM1_BITS, 0x00000001
.equ	RISCV_DM_HALTSUM1_RESET, 0x00000000
.equ	RISCV_DM_HALTSUM1_MSB, 0
.equ	RISCV_DM_HALTSUM1_LSB, 0
# =============================================================================
# Register    : RISCV_DM_HAWINDOWSEL
# Description : This register selects which of the 32-bit portion of the hart
#               array mask register is accessible in hawindow.
.equ	RISCV_DM_HAWINDOWSEL_OFFSET, 0x00000050
.equ	RISCV_DM_HAWINDOWSEL_BITS, 0x00007fff
.equ	RISCV_DM_HAWINDOWSEL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RISCV_DM_HAWINDOWSEL_HAWINDOWSEL
# Description : On Hazard3 this register is entirely hardwired to 0.
.equ	RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_RESET, 0x0000
.equ	RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_BITS, 0x00007fff
.equ	RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_MSB, 14
.equ	RISCV_DM_HAWINDOWSEL_HAWINDOWSEL_LSB, 0
